# Упражнение №_2
# if - elif - else

# Увражнение №_2
pg = "Погода"
city_1 = 'Минск'
city_2 = 'Москва'

dt = "Дата"
j = "Шутка"

ask = input("Выберите:\n    Погода\n    Дата\n    Шутка:\n")
# блок погоды, выбор Минск/Москва
if ask == pg:
    city = input('Выберите город:\n     Минск\n     Москва:\n')
    if city == city_1:
        print("Погода в Минске ясная, + 25")
    elif city == city_2:
        print('Погда в Москве облачная, местами дождь, + 20')
# дата
elif ask == dt:
    print('Сегодня 15.08.2021 года')
# Шутка
elif ask == j:
    print('На экзамене пошутишь!')