# Даны 2 числа с плавающей точкой. Найти среднее
# арифметическое и среднее геометрическое этих чисел
# среднее арифметическое = a + b \ 2
a = float(input('Введите не целое число "a": '))
b = float(input('Введите не целое число "b": '))
c = (a + b) / 2
d = (a * b) ** 0.5
print("Среднее арифметическое этих чисел =", + c)
print("Среднее геометрическое этих чисел =", + d)

