# Даны 2 числа "а" и "b". Получить их сумму, разность и произведение
a = float(input("Введите число с плавающей точкой: "))
b = float(input("Введите число с плавающей точкой: "))
print(a + b, a - b, a * b)