'''
Даны два целых числа m и n (m≤n).
Напишите программу, которая выводит все
числа от m до n включительно.
'''
m = 5
n = 15
for i in range(m, n):
    i += 1
    print(i)